<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <meta content="text/html; charset=ISO-8859-1"
      http-equiv="Content-Type">
    <title>About</title>
  </head>
  <body>
    <h1 style="text-align: center;">Changjie Keyboard</h1>
    <div style="text-align: center;">
      <h2>Ver. 0.1<br>
      </h2>
    </div>
    <br>
    <p>&nbsp;&nbsp;&nbsp; Changjie Chinese Input Method for Android<br>
      &nbsp;&nbsp;&nbsp; Copyright (C) 2012 LinkOmnia Ltd.&nbsp; <br>
      <br>
      &nbsp;&nbsp;&nbsp; Author: Wan Leung Wong (wanleung@linkomnia.com)<br>
      <br>
      &nbsp;&nbsp;&nbsp; Changjie Chinese Input Method for Android<br>
      &nbsp;&nbsp;&nbsp; Copyright (C) 2012 LinkOmnia Ltd.<br>
      <br>
      &nbsp;&nbsp;&nbsp; Author: Wan Leung Wong (wanleung@linkomnia.com)<br>
      <br>
      &nbsp;&nbsp;&nbsp; This program is free software: you can
      redistribute it and/or modify<br>
      &nbsp;&nbsp;&nbsp; it under the terms of the GNU General Public
      License as published by<br>
      &nbsp;&nbsp;&nbsp; the Free Software Foundation, either version 3
      of the License, or<br>
      &nbsp;&nbsp;&nbsp; (at your option) any later version.<br>
      <br>
      &nbsp;&nbsp;&nbsp; This program is distributed in the hope that it
      will be useful,<br>
      &nbsp;&nbsp;&nbsp; but WITHOUT ANY WARRANTY; without even the
      implied warranty of<br>
      &nbsp;&nbsp;&nbsp; MERCHANTABILITY or FITNESS FOR A PARTICULAR
      PURPOSE.&nbsp; See the<br>
      &nbsp;&nbsp;&nbsp; GNU General Public License for more details.<br>
      <br>
      &nbsp;&nbsp;&nbsp; You should have received a copy of the GNU
      General Public License<br>
      &nbsp;&nbsp;&nbsp; along with this program.&nbsp; If not, see
      &lt;http://www.gnu.org/licenses/&gt;.<br>
      <br>
      Source: <a
        href="https://github.com/wanleung/ChangjieKeyboard-android">https://github.com/wanleung/ChangjieKeyboard-android</a><br>
      Bug Report or Suggestion: <a
        href="https://github.com/wanleung/ChangjieKeyboard-android/issues">https://github.com/wanleung/ChangjieKeyboard-android/issues</a><br>
      Wiki: <a
        href="https://github.com/wanleung/ChangjieKeyboard-android/wiki">https://github.com/wanleung/ChangjieKeyboard-android/wiki</a><br>
    </p>
    <h3>About Changjie Chinese Input Method<br>
    </h3>
    <p> &nbsp;&nbsp;&nbsp;&nbsp; The project was started by a group of
      elders in Hong Kong in 2003.<br>
      It is design for stoked elders who had difficulty on using
      computer for input Chinese characters. Changjie had categorized the
      Chinese Storkes in to five types, Zigzag Horizontal(Rise), Throw
      away, Dot(Press down) and Vertical, which are mapping on "n","m",
      ",", ".", and "/". As Changjie uses five keys to input which means
      people can use one hand to type Chinese characters. <br>
      <br>
      As people who learn Chinese must have to learn how to use Strokes
      to write Chinese Characters, Changjie is an easy way to input
      Chinese Characters without learing any other kinds of Chinese
      Input Method. This means it is easy for those espically elders who
      haven't learn any PinYin or ZhuYin before (as not all Chinese know
      Mandarin) to type Chinese on Computer which means it can help to
      narrow down the Digital Divide between elders and the socitey.<br>
      <br>
      Changjie is not just for elders but also for kids. The project had
      run an experiment in a kindergarten that taught K3 children to
      learn how to use Changjie. After that childen could type their own
      Chinese name on the computer. <br>
      <br>
      For More information you can find in here: (Chinese) <a
        href="http://stroke5.webnode.tw/">http://stroke5.webnode.tw/ </a><br>
      <br>
      Changjie Chinese Input Method Original Project: <a
        href="http://sf.net/projects/stroke5input">http://sf.net/projects/stroke5input</a><br>
      <br>
    </p>
    <h3> &#12300;&#31558;&#38918;&#20116;&#30908;&#12301;&#30340;&#30001;&#20358;&#21450;&#30332;&#23637;&#65306;</h3>
    <p> &nbsp;&nbsp;&nbsp;
      2003-04&#24180;&#38291;&#65292;&#22240;&#28858;&#35201;&#21332;&#21161;&#23559;&#36557;&#28595;&#19968;&#38291;&#32769;&#20154;&#35703;&#39178;&#38498;&#65292;&#28858;&#20854;&#20013;&#39080;&#38498;&#21451;&#36914;&#34892;&#19978;&#32178;&#35506;&#31243;&#65292;&#20854;&#20013;&#19968;&#20491;&#35201;&#27714;&#26159;&#25945;&#38498;&#21451;&#38651;&#37109;&#28317;&#36890;&#65292;&#19968;&#32676;&#38263;&#32773;&#23601;&#33258;&#34892;&#38283;&#30332;&#20102;&#21482;&#38656;&#29992;&#19968;&#38587;&#25163;&#23601;&#21487;
      &#20197;&#36664;&#20837;&#20013;&#25991;&#23383;&#30340;&#20813;&#36027;&#20013;&#25991;&#36664;&#20837;&#27861;&#9472;&#9472;&#12300;&#31558;&#38918;&#20116;&#30908;&#12301;&#65292;&#21450;&#24460;&#20877;&#22312;&#23559;&#36557;&#28595;&#19968;&#25152;&#24188;&#20818;&#22290;&#65292;&#25945;&#25480;&#65323;&#65299;&#24188;&#31461;&#20013;&#25991;&#36664;&#20837;&#27861;&#65292;&#23567;&#26379;&#21451;&#24456;&#38283;&#24515;&#22320;&#22312;&#38651;&#33126;&#19978;&#25171;&#19978;&#33258;&#24049;&#30340;&#21517;
      &#23383;&#65292;&#32769; &#24107;&#20497;&#31281;&#35738;&#36889;&#20491;&#36664;&#20837;&#27861;&#27491;&#20999;&#21512;&#20182;&#20497;&#25945;&#20013;&#25991;&#23383;&#23433;&#25490;&#12290;<br>
      <br>
      &nbsp;&nbsp;&nbsp;
      &#30001;&#26044;&#20197;&#31558;&#21123;&#12289;&#31558;&#38918;&#28858;&#22522;&#30990;&#30340;&#36664;&#20837;&#27861;&#65292;&#27491;&#26159;&#26681;&#25818;&#23416;&#32722;&#20013;&#25991;&#23383;&#30340;&#21407;&#21063;&#65292;&#32769;&#24107;&#20497;&#23601;&#26159;&#20808;&#35201;&#23567;&#31461;&#23416;&#23531;&#31558;&#21123;&#65292;&#30452;&#26159;&#30001;&#19978;&#33267;&#19979;&#65292;&#27243;&#26159;&#30001;&#24038;&#33267;&#21491;&#65292;&#28982;&#24460;&#20381;&#31558;&#38918;&#23559;&#31558;&#21123;&#27083;&#25104;&#20013;&#25991;&#23383;&#12290;&#25152;
      &#20197;&#12300;&#31558;&#38918;&#20116;&#30908;&#12301;&#30340;&#35373;&#35336;&#22522;&#30990;&#27491;&#26159;&#25152;&#26377;&#20013;&#22283;&#20154;&#65288;&#19981;&#21516;&#24180;&#40801;&#65289;&#30340;&#20849;&#36890;&#40670;&#65292;&#28961;&#38656;&#37325;&#26032;&#23416;&#32722;&#26032;&#30340;&#23383;&#22411;&#20998;&#25286;&#21407;&#21063;&#12290;&#36664;&#20837;&#37749;&#25505;&#29992;&#27161;&#28310;&#36664;&#20837;&#21312;&#30340;&#19968;&#21015;&#20116;&#20491;&#37749;&#65292;&#31777;&#21934;&#26131;
      &#35352;&#65292;&#28961; &#38656;&#36028;&#32025;&#12290;<br>
      <br>
      &nbsp;&nbsp;&nbsp; &#12300;&#31558;&#38918;&#20116;&#30908;&#12301;&#22312;2003&#24180;&#30001;&#39321;&#28207;&#38263;&#32773;&#36039;&#35338;&#22825;&#22320;&#30340;&#19968;&#32676;&#38263;&#32773;&#20849;&#21516;&#38283;&#30332;&#65292;&#20197;&#12300;N&#12301;&#12300;M&#12301;&#12300;,&#12301;
      &#12300;.&#12301;&#12300;/&#12301;&#20116;&#20491;&#37749;&#25353;&#20013;&#25991;&#23383;&#30340;&#31558;&#21123;&#21644;&#31558;&#38918;&#36664;&#20837;&#20013;&#25991;&#23383;&#65292;&#20006;&#20197;GPL&#30340;&#20998;&#20139;&#29256;&#27402;&#38283;&#25918;&#21407;&#22987;&#30908;&#30332;&#20296;&#65292;&#21450;&#24460;&#38515;&#26313;&#38525;&#20808;&#29983;&#23559;&#36889;&#36664;&#20837;&#27861;&#21152;&#20837;SCIM&#31995;&#32113;&#65292;&#25104;&#28858;&#26085;&#24460;
      Linux&#20013;&#25991;&#36664;&#20837;&#27861;&#20043;&#19968;&#12290;&#20043;&#24460;&#26377;&#20154;&#23559;&#20043;&#31227;&#26893;&#33267;Windows 98&#21450;Windows
      XP&#25033;&#29992;&#65292;&#20786;&#23384;&#22312;&#25945;&#32946;&#22478;&#32178;&#31449;&#20379;&#20154;&#19979;&#36617;&#65292;&#20294;&#29694;&#26178;&#24050;&#28961;&#27861;&#19979;&#36617;&#12290;<br>
      <br>
      &nbsp;&nbsp;&nbsp;
      &#12300;&#31558;&#38918;&#20116;&#30908;&#12301;0.4&#29256;&#24050;&#36229;&#36942;&#20843;&#24180;&#27511;&#21490;&#65292;&#27794;&#26377;&#20462;&#35330;&#32173;&#35703;&#65292;&#31001;&#26044;&#30070;&#24180;Big-5&#20013;&#25991;&#20839;&#30908;&#28858;&#20027;&#65292;&#21450;&#20379;&#20013;&#39080;&#38263;&#32773;&#20316;&#19968;&#33324;&#28317;&#36890;&#20043;&#29992;&#65292;&#25152;&#20197;&#26681;&#25818;&#19968;&#33324;&#20013;&#22283;&#20154;&#30340;&#35672;&#23383;&#37327;&#65292;&#21482;&#21487;&#36664;
      &#20837;&#32004;4000&#20013;&#25991;&#23383;&#65292;&#19968;&#20123;&#39321;&#28207;&#24120;&#29992;&#23383;&#22914;&#23627;&#12300;&#37032;&#12301;&#65292;&#28145;&#27700;&#12300;&#22487;&#12301;&#65292;&#12300;&#39938;&#12301;&#39770;&#28044;&#20063;&#26410;&#33021;&#36664;&#20837;&#12290;&#20294;&#29694;&#26178;&#24050;&#26222;&#36941;&#25505;&#29992;UniCode&#65292;&#25152;&#20197;&#26377;&#38656;&#35201;&#36914;&#34892;&#26356;&#26032;&#21644;
      &#28155; &#23383;&#65292;&#35731;&#31995;&#32113;&#26356;&#30410;&#23436;&#21892;&#12290;<br>
    </p>
    <br>
    <h3>Portions of this application provided under the following
      licenses:</h3>
    <h4>Changjie Chinese Input Method Table:</h4>
    <p>&#31558;&#38918;&#20116;&#30908;&#20013;&#25991;&#36664;&#20837;&#27861;1.0&#29256; &lt;http://sf.net/projects/stroke5input&gt;<br>
      &#29256;&#27402;: GPL v3<br>
      &nbsp;&nbsp; &lt;Changjie Chinese Input Method&gt; is an open
      source project created by Hong Kong Seniors IT Advocates at 2003.
      Only use five keys and follow the stroke order to input Chinese
      characters.<br>
      Copyright (C) &lt;2003&gt;&nbsp; &lt;Leung King man (Hong Kong
      Seniors IT Advocates)&gt;<br>
      <br>
      This program is free software: you can redistribute it and/or
      modify<br>
      it under the terms of the GNU General Public License as published
      by<br>
      the Free Software Foundation, either version 3 of the License, or
      any later version.<br>
      <br>
      This program is distributed in the hope that it will be useful,<br>
      but WITHOUT ANY WARRANTY; without even the implied warranty of<br>
      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.&nbsp; See the<br>
      GNU General Public License for more details.
      &lt;http://www.gnu.org/licenses/&gt;<br>
      <br>
      &#25903;&#25588;&#21450;&#32173;&#35703;: &#39321;&#28207;&#38263;&#32773;&#36039;&#35338;&#22825;&#22320; Hong Kong Seniors IT Advocates<br>
      &#38283;&#30332;&#20154;&#22763;&#21517;&#21934;:<br>
      &#26753;&#25964;&#25991; Leung King Man &lt;leung8964@yahoo.com.hk&gt;<br>
      &#29579;&#28500;&#35998; Amy Wong<br>
      &#38515;&#33603; Chan Chuen<br>
      &#40845;&#27491;&#24544; Lung Ching Chung<br>
      &#21476;&#22283;&#32681; Richard Ku<br>
      &#29579;&#26519;&#26681; Mike Wong<br>
      &#37101;&#26999; Kwok Kai<br>
      &#21570;&#34081;&#32654;&#20908; Vivian Choi<br>
      &#38364;&#23113;&#24904; Wendy Kwan<br>
      &#38515;&#29577;&#33805; Pinky Chan<br>
      &#32645;&#21531;&#29734; Kae Kae Law<br>
      1.0&#29256;&#26044;2011&#24180;9&#26376;20&#26085;&#38754;&#19990;, &#22686;&#21152;&#25903;&#25588;&#33267;26,000&#23383;, &#20462;&#27491;&#36664;&#20837;&#31558;&#21123;&#37679;&#35492;<br>
      0.9&#29256;&#26044;2011&#24180;3&#26376;25&#26085;&#38754;&#19990;, &#22686;&#21152;&#25903;&#25588;&#33267;17,000&#23383;, &#32232;&#30908;&#25913;&#28858;Unicode,
      &#21450;&#21443;&#32771;&#39321;&#28207;&#25945;&#32946;&#23616;"&#39321;&#28207;&#23567;&#23416;&#23416;&#32722;&#23383;&#35422;&#34920;"&#30340;&#31558;&#38918;&#27425;&#24207;<br>
      0.4&#29256;&#26044;2003&#24180;11&#26376;6&#26085;&#38754;&#19990;, &#20462;&#27491;&#36664;&#20837;&#31558;&#21123;&#37679;&#35492;<br>
      0.3&#29256;&#26044;2003&#24180;10&#26376;28&#26085;&#38754;&#19990;, &#23565;&#27604;"&#30334;&#23478;&#22995;", &#21152;&#20837;37&#23383;<br>
      0.2&#29256;&#26044;2003&#24180;10&#26376;25&#26085;&#38754;&#19990;, &#23565;&#27604;&#39321;&#28207;&#25919;&#24220;&#30340;"&#24120;&#29992;&#23383;&#23383;&#24418;&#34920;", &#21152;&#20837;620&#23383;<br>
      0.1&#29256;&#26044;2003&#24180;10&#26376;17&#26085;&#38754;&#19990;, &#29992;&#26044;&#20839;&#37096;&#28204;&#35430;, &#26681;&#25818;&#20309;&#31168;&#29004;&#25945;&#25480;&#30340;80-90&#24180;&#20195;&#23383;&#38971;&#30740;&#31350;, &#23433;&#25490;4600&#23383;<br>
    </p>
    <br>
    <h4>Phrase Dictionary:</h4>
    <p>gcin v2.7.5<br>
      <br>
      Copyright (C) 1995-2012&nbsp; Edward Der-Hua Liu, Hsin-Chu, Taiwan<br>
      <br>
      This library is free software; you can redistribute it and/or<br>
      modify it under the terms of the GNU Lesser General Public<br>
      License as published by the Free Software Foundation; either<br>
      version 2.1 of the License, or (at your option) any later version.<br>
      <br>
      This library is distributed in the hope that it will be useful,<br>
      but WITHOUT ANY WARRANTY; without even the implied warranty of<br>
      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.&nbsp; See the
      GNU<br>
      Lesser General Public License for more details.<br>
      <br>
      You should have received a copy of the GNU Lesser General Public<br>
      License along with this library; if not, write to the Free
      Software<br>
      Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
      MA&nbsp; 02110-1301&nbsp; USA<br>
      <br>
      --------------------------------------------------------------<br>
      This File is branch out from gcin version 2.7.5 on 20 March 2012<br>
      for the usage of Changjie Chinese Input Method on Android<br>
      <br>
      You can get the source from here: <a
        href="http://cle.linux.org.tw/gcin/download/gcin-2.7.5.tar.xz">http://cle.linux.org.tw/gcin/download/gcin-2.7.5.tar.xz</a><br>
      <br>
      For more details, please visit: <a
        href="http://cle.linux.org.tw/trac">http://cle.linux.org.tw/trac
      </a><br>
      <br>
      <br>
    </p>
  </body>
</html>
